app/controllers/ships_controller.rb

  def index
    @ships = Ship.all
---
SELECT `ships`.* FROM `ships`

  def show
    @ship = Ship.find_by_id(params[:id])
---
SELECT `ships`.* FROM `ships` WHERE `ships`.`id` = 3 LIMIT 1

  def create

    @ship = Ship.new(params[:ship])

    if @ship.save
---
INSERT INTO `ships` (`armament`, `created_at`, `crew`, `has_astromech`, `name`, `speed`, `updated_at`) VALUES ('yes', '2014-06-30 16:09:56', 3, 1, 'shiva ', 100, '2014-06-30 16:09:56')

  def edit
    @ship = Ship.find_by_id(params[:id])
---
SELECT `ships`.* FROM `ships` WHERE `ships`.`id` = 3 LIMIT 1

  def update
    @ship = Ship.find_by_id(params[:id])

    if @ship.update_attributes(params[:ship])
---
SELECT `ships`.* FROM `ships` WHERE `ships`.`id` = 3 LIMIT 1
UPDATE "ships" SET "name" = 'RZ-1 A-Wing', "updated_at" = '2012-12-07 22:38:20.585119' WHERE "ships"."id" = 1

  def destroy
    @ship = Ship.find(params[:id])

    if @ship.destroy
---
SELECT "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT 1  [["id", "13"]]
DELETE FROM "ships" WHERE "ships"."id" = ?  [["id", 13]]